### Preparing The Enviroment

In [1]:
%load_ext sql


from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:Olisebinum@localhost:3306/united_nations")

%sql engine

### Loading our Database

In [2]:
%%sql

SELECT
    Country_name,
    Sub_region,
    Land_area
FROM
    united_nations.Access_to_Basic_Services
WHERE 
    Time_period = 2020
    AND Land_area IS NOT NULL ;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

130 rows affected.

+--------------+---------------+------------+
| Country_name |   Sub_region  | Land_area  |
+--------------+---------------+------------+
|  Kazakhstan  |  Central Asia | 2699700.00 |
|  Tajikistan  |  Central Asia | 138790.00  |
| Turkmenistan |  Central Asia | 469930.00  |
|  Uzbekistan  |  Central Asia | 440650.00  |
| Afghanistan  | Southern Asia | 652230.00  |
|  Bangladesh  | Southern Asia | 130170.00  |
|    Bhutan    | Southern Asia |  38140.00  |
|    India     | Southern Asia | 2973190.00 |
|   Maldives   | Southern Asia |   300.00   |
|    Nepal     | Southern Asia | 143350.00  |
+--------------+---------------+------------+
Truncated to displaylimit of 10.

## Applying Window Functions

In [3]:
%%sql

SELECT
	Country_name,
    Sub_region,
    Land_area,
    SUM(Land_area) OVER(
		partition by Sub_region) AS Pct_sub_region_land_area
FROM
	united_nations.Access_to_Basic_Services
WHERE 
	Time_period = 2020
    AND Land_area IS NOT NULL;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

130 rows affected.

+------------------------+---------------------------+------------+--------------------------+
|      Country_name      |         Sub_region        | Land_area  | Pct_sub_region_land_area |
+------------------------+---------------------------+------------+--------------------------+
|      New Zealand       | Australia and New Zealand | 263310.00  |        7955330.00        |
|       Australia        | Australia and New Zealand | 7692020.00 |        7955330.00        |
|        Barbados        |         Caribbean         |   430.00   |        205080.00         |
|  Trinidad and Tobago   |         Caribbean         |  5130.00   |        205080.00         |
|      Puerto Rico       |         Caribbean         |  8870.00   |        205080.00         |
|        Jamaica         |         Caribbean         |  10830.00  |        205080.00         |
|         Haiti          |         Caribbean         |  27560.00  |        205080.00         |
|   Dominican Republic   |         Caribbean         |  48310.00  |        205080.00         |
|          Cuba          |         Caribbean         | 103800.00  |        205080.00         |
| British Virgin Islands |         Caribbean         |   150.00   |        205080.00         |
+------------------------+---------------------------+------------+--------------------------+
Truncated to displaylimit of 10.

In [4]:
%%sql

SELECT
	Country_name,
    Sub_region,
    Land_area,
    ROUND(Land_area)/SUM(Land_area) OVER(
		partition by Sub_region ) * 100 AS Pct_sub_region_land_area
FROM
	united_nations.Access_to_Basic_Services
WHERE 
	Time_period = 2020
    AND Land_area IS NOT NULL;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

130 rows affected.

+------------------------+---------------------------+------------+--------------------------+
|      Country_name      |         Sub_region        | Land_area  | Pct_sub_region_land_area |
+------------------------+---------------------------+------------+--------------------------+
|      New Zealand       | Australia and New Zealand | 263310.00  |          3.3099          |
|       Australia        | Australia and New Zealand | 7692020.00 |         96.6901          |
|        Barbados        |         Caribbean         |   430.00   |          0.2097          |
|  Trinidad and Tobago   |         Caribbean         |  5130.00   |          2.5015          |
|      Puerto Rico       |         Caribbean         |  8870.00   |          4.3251          |
|        Jamaica         |         Caribbean         |  10830.00  |          5.2809          |
|         Haiti          |         Caribbean         |  27560.00  |         13.4387          |
|   Dominican Republic   |         Caribbean         |  48310.00  |         23.5567          |
|          Cuba          |         Caribbean         | 103800.00  |         50.6144          |
| British Virgin Islands |         Caribbean         |   150.00   |          0.0731          |
+------------------------+---------------------------+------------+--------------------------+
Truncated to displaylimit of 10.

In [5]:
%%sql

SELECT 
	Country_name,
    Sub_region,
    Time_period,
    Est_population_in_millions
FROM
	united_nations.Access_to_Basic_Services
WHERE 
	Est_population_in_millions IS NOT NULL ;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

815 rows affected.

+--------------+--------------+-------------+----------------------------+
| Country_name |  Sub_region  | Time_period | Est_population_in_millions |
+--------------+--------------+-------------+----------------------------+
|  Kazakhstan  | Central Asia |     2015    |         17.542806          |
|  Kazakhstan  | Central Asia |     2016    |         17.794055          |
|  Kazakhstan  | Central Asia |     2017    |         18.037776          |
|  Kazakhstan  | Central Asia |     2018    |         18.276452          |
|  Kazakhstan  | Central Asia |     2019    |         18.513673          |
|  Kazakhstan  | Central Asia |     2020    |         18.755666          |
|  Tajikistan  | Central Asia |     2015    |          8.524063          |
|  Tajikistan  | Central Asia |     2016    |          8.725318          |
|  Tajikistan  | Central Asia |     2017    |          8.925525          |
|  Tajikistan  | Central Asia |     2018    |          9.128132          |
+--------------+--------------+-------------+----------------------------+
Truncated to displaylimit of 10.

In [6]:
%%sql

SELECT 
	Country_name,
    Sub_region,
    Time_period,
    Est_population_in_millions,
    ROUND(AVG(Est_population_in_millions) OVER(
    PARTITION BY Sub_region), 4) AS Running_avg_population
FROM
	united_nations.Access_to_Basic_Services
WHERE 
	Est_population_in_millions IS NOT NULL ;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

815 rows affected.

+--------------+---------------------------+-------------+----------------------------+------------------------+
| Country_name |         Sub_region        | Time_period | Est_population_in_millions | Running_avg_population |
+--------------+---------------------------+-------------+----------------------------+------------------------+
| New Zealand  | Australia and New Zealand |     2020    |          5.090200          |        14.8059         |
|  Australia   | Australia and New Zealand |     2015    |         23.815995          |        14.8059         |
|  Australia   | Australia and New Zealand |     2016    |         24.190907          |        14.8059         |
|  Australia   | Australia and New Zealand |     2017    |         24.594202          |        14.8059         |
|  Australia   | Australia and New Zealand |     2018    |         24.966643          |        14.8059         |
|  Australia   | Australia and New Zealand |     2019    |         25.340217          |        14.8059         |
|  Australia   | Australia and New Zealand |     2020    |         25.655289          |        14.8059         |
| New Zealand  | Australia and New Zealand |     2015    |          4.609400          |        14.8059         |
| New Zealand  | Australia and New Zealand |     2016    |          4.714100          |        14.8059         |
| New Zealand  | Australia and New Zealand |     2017    |          4.813600          |        14.8059         |
+--------------+---------------------------+-------------+----------------------------+------------------------+
Truncated to displaylimit of 10.

In [7]:
%%sql
SELECT 
	Country_name,
    Sub_region,
    Time_period,
    Est_population_in_millions,
    ROUND(AVG(Est_population_in_millions) OVER(
    PARTITION BY Sub_region  ORDER BY Time_period), 4) AS Running_avg_population
FROM
	united_nations.Access_to_Basic_Services
WHERE 
	Est_population_in_millions IS NOT NULL ;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

815 rows affected.

+--------------+---------------------------+-------------+----------------------------+------------------------+
| Country_name |         Sub_region        | Time_period | Est_population_in_millions | Running_avg_population |
+--------------+---------------------------+-------------+----------------------------+------------------------+
|  Australia   | Australia and New Zealand |     2015    |         23.815995          |        14.2127         |
| New Zealand  | Australia and New Zealand |     2015    |          4.609400          |        14.2127         |
|  Australia   | Australia and New Zealand |     2016    |         24.190907          |        14.3326         |
| New Zealand  | Australia and New Zealand |     2016    |          4.714100          |        14.3326         |
|  Australia   | Australia and New Zealand |     2017    |         24.594202          |        14.4564         |
| New Zealand  | Australia and New Zealand |     2017    |          4.813600          |        14.4564         |
|  Australia   | Australia and New Zealand |     2018    |         24.966643          |        14.5757         |
| New Zealand  | Australia and New Zealand |     2018    |          4.900600          |        14.5757         |
| New Zealand  | Australia and New Zealand |     2019    |          4.979200          |        14.6925         |
|  Australia   | Australia and New Zealand |     2019    |         25.340217          |        14.6925         |
+--------------+---------------------------+-------------+----------------------------+------------------------+
Truncated to displaylimit of 10.

## Aggregations Using Windows Functions

##  Exercise
Task 1: Select the data required for the analysis
The columns you select should include:

Sub_region
Country_name
Land_area
Filter out the results using the following criteria:

For the Time_period of 2020.
For Land_area values that are not missing.

In [9]:
%%sql

SELECT
    Sub_region,
    Country_name,
    Land_area
FROM
    united_nations.Access_to_Basic_Services
WHERE 
    Time_period = 2020
    AND Land_area IS NOT NULL;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

130 rows affected.

+---------------+--------------+------------+
|   Sub_region  | Country_name | Land_area  |
+---------------+--------------+------------+
|  Central Asia |  Kazakhstan  | 2699700.00 |
|  Central Asia |  Tajikistan  | 138790.00  |
|  Central Asia | Turkmenistan | 469930.00  |
|  Central Asia |  Uzbekistan  | 440650.00  |
| Southern Asia | Afghanistan  | 652230.00  |
| Southern Asia |  Bangladesh  | 130170.00  |
| Southern Asia |    Bhutan    |  38140.00  |
| Southern Asia |    India     | 2973190.00 |
| Southern Asia |   Maldives   |   300.00   |
| Southern Asia |    Nepal     | 143350.00  |
+---------------+--------------+------------+
Truncated to displaylimit of 10.

## Task 2: Calculate the land area covered as a percentage of the country's subregion
Calculate each land area as a percentage within its sub_region:

Divide the Land_area by the SUM() BY the areas OVER each Sub_region's PARTITION. Name this column pct_sub_region_land_area.
Round the calculation off to 4 decimal places.
Add this line to the query from the first task.

In [14]:
%%sql

SELECT
	Country_name,
    Sub_region,
    Land_area,
    ROUND(Land_area)/SUM(Land_area) OVER(
		partition by Sub_region ) * 100 AS Pct_sub_region_land_area
FROM
	united_nations.Access_to_Basic_Services
WHERE 
	Time_period = 2020
    AND Land_area IS NOT NULL;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

130 rows affected.

+------------------------+---------------------------+------------+--------------------------+
|      Country_name      |         Sub_region        | Land_area  | Pct_sub_region_land_area |
+------------------------+---------------------------+------------+--------------------------+
|      New Zealand       | Australia and New Zealand | 263310.00  |          3.3099          |
|       Australia        | Australia and New Zealand | 7692020.00 |         96.6901          |
|        Barbados        |         Caribbean         |   430.00   |          0.2097          |
|  Trinidad and Tobago   |         Caribbean         |  5130.00   |          2.5015          |
|      Puerto Rico       |         Caribbean         |  8870.00   |          4.3251          |
|        Jamaica         |         Caribbean         |  10830.00  |          5.2809          |
|         Haiti          |         Caribbean         |  27560.00  |         13.4387          |
|   Dominican Republic   |         Caribbean         |  48310.00  |         23.5567          |
|          Cuba          |         Caribbean         | 103800.00  |         50.6144          |
| British Virgin Islands |         Caribbean         |   150.00   |          0.0731          |
+------------------------+---------------------------+------------+--------------------------+
Truncated to displaylimit of 10.

## Task 3: Calculate The running population average for each country's subregion
Start by selecting the columns needed for this analysis:

Sub_region
Country_name
Time_period
Pct_managed_drinking_water_services
Pct_managed_sanitation_services
Est_gdp_in_billions
Est_population_in_millions
Calculate the running average:

Calculate the AVG() of the Est_population_in_millions.
PARTITION the calculation OVER each country's Sub_region, and name this column Running_average_population.
ROUND the calculation off to 4 decimal places.
Filter the results WHERE there are values of Est_gdp_in_billions that are NOT NULL.

In [17]:
%%sql

SELECT
    Sub_region,
    Country_name,
    Time_period,
    Pct_managed_drinking_water_services,
    Pct_managed_sanitation_services,
    Est_gdp_in_billions,
    Est_population_in_millions,
    ROUND(AVG(Est_population_in_millions) OVER(
    PARTITION BY Sub_region ORDER BY Time_period), 4) As Running_average_population
FROM 
    united_nations.Access_to_Basic_Services
WHERE 
    Est_gdp_in_billions IS NOT NULL;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

800 rows affected.

+---------------------------+--------------+-------------+-------------------------------------+---------------------------------+---------------------+----------------------------+----------------------------+
|         Sub_region        | Country_name | Time_period | Pct_managed_drinking_water_services | Pct_managed_sanitation_services | Est_gdp_in_billions | Est_population_in_millions | Running_average_population |
+---------------------------+--------------+-------------+-------------------------------------+---------------------------------+---------------------+----------------------------+----------------------------+
| Australia and New Zealand |  Australia   |     2015    |                100.00               |              100.00             |       1350.62       |         23.815995          |          14.2127           |
| Australia and New Zealand | New Zealand  |     2015    |                100.00               |              100.00             |        178.06       |          4.609400          |          14.2127           |
| Australia and New Zealand |  Australia   |     2016    |                100.00               |              100.00             |       1206.54       |         24.190907          |          14.3326           |
| Australia and New Zealand | New Zealand  |     2016    |                100.00               |              100.00             |        188.84       |          4.714100          |          14.3326           |
| Australia and New Zealand |  Australia   |     2017    |                100.00               |              100.00             |       1326.52       |         24.594202          |          14.4564           |
| Australia and New Zealand | New Zealand  |     2017    |                100.00               |              100.00             |        206.62       |          4.813600          |          14.4564           |
| Australia and New Zealand |  Australia   |     2018    |                100.00               |              100.00             |       1428.29       |         24.966643          |          14.5757           |
| Australia and New Zealand | New Zealand  |     2018    |                100.00               |              100.00             |        211.95       |          4.900600          |          14.5757           |
| Australia and New Zealand | New Zealand  |     2019    |                100.00               |              100.00             |        213.43       |          4.979200          |          14.6925           |
| Australia and New Zealand |  Australia   |     2019    |                100.00               |              100.00             |       1392.23       |         25.340217          |          14.6925           |
+---------------------------+--------------+-------------+-------------------------------------+---------------------------------+---------------------+----------------------------+----------------------------+
Truncated to displaylimit of 10.

In [18]:
%%sql

SELECT 
	Country_name,
    Sub_region,
    Time_period,
    Pct_managed_drinking_water_services,
    ROW_NUMBER() OVER(
		PARTITION BY Time_period ORDER BY Pct_managed_drinking_water_services) AS rank_of_water_services
FROM
	united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1048 rows affected.

+----------------------------------+----------------+-------------+-------------------------------------+------------------------+
|           Country_name           |   Sub_region   | Time_period | Pct_managed_drinking_water_services | rank_of_water_services |
+----------------------------------+----------------+-------------+-------------------------------------+------------------------+
|     Central African Republic     | Middle Africa  |     2015    |                44.00                |           1            |
| Democratic Republic of the Congo | Middle Africa  |     2015    |                45.33                |           2            |
|           South Sudan            | Eastern Africa |     2015    |                46.33                |           3            |
|              Angola              | Middle Africa  |     2015    |                50.33                |           4            |
|             Somalia              | Eastern Africa |     2015    |                50.67                |           5            |
|               Chad               | Middle Africa  |     2015    |                51.67                |           6            |
|             Ethiopia             | Eastern Africa |     2015    |                52.00                |           7            |
|            Madagascar            | Eastern Africa |     2015    |                53.33                |           8            |
|         Papua New Guinea         |   Melanesia    |     2015    |                53.67                |           9            |
|              Uganda              | Eastern Africa |     2015    |                55.00                |           10           |
+----------------------------------+----------------+-------------+-------------------------------------+------------------------+
Truncated to displaylimit of 10.

In [19]:
%%sql

SELECT 
	Country_name,
    Sub_region,
    Time_period,
    Pct_managed_drinking_water_services,
    RANK() OVER(
		PARTITION BY Time_period ORDER BY Pct_managed_drinking_water_services) AS rank_of_water_services
FROM
	united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1048 rows affected.

+----------------------------------+----------------+-------------+-------------------------------------+------------------------+
|           Country_name           |   Sub_region   | Time_period | Pct_managed_drinking_water_services | rank_of_water_services |
+----------------------------------+----------------+-------------+-------------------------------------+------------------------+
|     Central African Republic     | Middle Africa  |     2015    |                44.00                |           1            |
| Democratic Republic of the Congo | Middle Africa  |     2015    |                45.33                |           2            |
|           South Sudan            | Eastern Africa |     2015    |                46.33                |           3            |
|              Angola              | Middle Africa  |     2015    |                50.33                |           4            |
|             Somalia              | Eastern Africa |     2015    |                50.67                |           5            |
|               Chad               | Middle Africa  |     2015    |                51.67                |           6            |
|             Ethiopia             | Eastern Africa |     2015    |                52.00                |           7            |
|            Madagascar            | Eastern Africa |     2015    |                53.33                |           8            |
|         Papua New Guinea         |   Melanesia    |     2015    |                53.67                |           9            |
|              Uganda              | Eastern Africa |     2015    |                55.00                |           10           |
+----------------------------------+----------------+-------------+-------------------------------------+------------------------+
Truncated to displaylimit of 10.

In [20]:
%%sql 

SELECT 
	Country_name,
    Sub_region,
    Time_period,
    Pct_managed_drinking_water_services,
    DENSE_RANK() OVER(
		PARTITION BY Time_period ORDER BY Pct_managed_drinking_water_services) AS rank_of_water_services
FROM
	united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1048 rows affected.

+----------------------------------+----------------+-------------+-------------------------------------+------------------------+
|           Country_name           |   Sub_region   | Time_period | Pct_managed_drinking_water_services | rank_of_water_services |
+----------------------------------+----------------+-------------+-------------------------------------+------------------------+
|     Central African Republic     | Middle Africa  |     2015    |                44.00                |           1            |
| Democratic Republic of the Congo | Middle Africa  |     2015    |                45.33                |           2            |
|           South Sudan            | Eastern Africa |     2015    |                46.33                |           3            |
|              Angola              | Middle Africa  |     2015    |                50.33                |           4            |
|             Somalia              | Eastern Africa |     2015    |                50.67                |           5            |
|               Chad               | Middle Africa  |     2015    |                51.67                |           6            |
|             Ethiopia             | Eastern Africa |     2015    |                52.00                |           7            |
|            Madagascar            | Eastern Africa |     2015    |                53.33                |           8            |
|         Papua New Guinea         |   Melanesia    |     2015    |                53.67                |           9            |
|              Uganda              | Eastern Africa |     2015    |                55.00                |           10           |
+----------------------------------+----------------+-------------+-------------------------------------+------------------------+
Truncated to displaylimit of 10.

## 1. Order countries based on their water access levels per year.
Use the ROW_NUMBER() function to order the countries based on their water access levels per year.

In [25]:
%%sql 

SELECT 
    Country_name, 
    Time_period,
    Pct_managed_drinking_water_services,
    ROW_NUMBER() OVER (PARTITION BY Time_period 
    ORDER BY Pct_managed_drinking_water_services) AS Rank_of_water_services
FROM
    united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1048 rows affected.

+----------------------------------+-------------+-------------------------------------+------------------------+
|           Country_name           | Time_period | Pct_managed_drinking_water_services | Rank_of_water_services |
+----------------------------------+-------------+-------------------------------------+------------------------+
|     Central African Republic     |     2015    |                44.00                |           1            |
| Democratic Republic of the Congo |     2015    |                45.33                |           2            |
|           South Sudan            |     2015    |                46.33                |           3            |
|              Angola              |     2015    |                50.33                |           4            |
|             Somalia              |     2015    |                50.67                |           5            |
|               Chad               |     2015    |                51.67                |           6            |
|             Ethiopia             |     2015    |                52.00                |           7            |
|            Madagascar            |     2015    |                53.33                |           8            |
|         Papua New Guinea         |     2015    |                53.67                |           9            |
|              Uganda              |     2015    |                55.00                |           10           |
+----------------------------------+-------------+-------------------------------------+------------------------+
Truncated to displaylimit of 10.

## 2. Assess the rankings for countries with the same water level access in a given year.
We expect countries with the same water level access in a given year to have the same rank since they are exactly the same value. Let us assess whether this is the case by filtering our results such that only records with 100% water level access are retrieved.

In [26]:
%%sql 

SELECT 
    Country_name, 
    Time_period,
    Pct_managed_drinking_water_services,
    ROW_NUMBER() OVER (PARTITION BY Time_period 
    ORDER BY Pct_managed_drinking_water_services) AS Rank_of_water_services
FROM
    united_nations.Access_to_Basic_Services
WHERE 
    Pct_managed_drinking_water_services = 100;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

208 rows affected.

+----------------------------+-------------+-------------------------------------+------------------------+
|        Country_name        | Time_period | Pct_managed_drinking_water_services | Rank_of_water_services |
+----------------------------+-------------+-------------------------------------+------------------------+
|         Singapore          |     2015    |                100.00               |           1            |
|          Bermuda           |     2015    |                100.00               |           2            |
|         Greenland          |     2015    |                100.00               |           3            |
|   British Virgin Islands   |     2015    |                100.00               |           4            |
|         Guadeloupe         |     2015    |                100.00               |           5            |
|         Martinique         |     2015    |                100.00               |           6            |
|      Saint Barthlemy      |     2015    |                100.00               |           7            |
| Saint Martin (French Part) |     2015    |                100.00               |           8            |
|          Bahrain           |     2015    |                100.00               |           9            |
|           Cyprus           |     2015    |                100.00               |           10           |
+----------------------------+-------------+-------------------------------------+------------------------+
Truncated to displaylimit of 10.

#### 3. Apply the RANK function instead.
We can try to correct this by using the RANK() function instead, since it assigns the same rank to similar values.

The following query works the same as the previous one with the ROW_NUMBER() function, it's just that we now have the RANK() function and rows with the same values will receive the same rank, and the next rank(s) are skipped accordingly.

In [28]:
%%sql 

SELECT 
    Country_name, 
    Time_period,
    Pct_managed_drinking_water_services,
    RANK() OVER (PARTITION BY Time_period 
    ORDER BY Pct_managed_drinking_water_services) AS Rank_of_water_services
FROM
    united_nations.Access_to_Basic_Services
LIMIT 20;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

20 rows affected.

+----------------------------------+-------------+-------------------------------------+------------------------+
|           Country_name           | Time_period | Pct_managed_drinking_water_services | Rank_of_water_services |
+----------------------------------+-------------+-------------------------------------+------------------------+
|     Central African Republic     |     2015    |                44.00                |           1            |
| Democratic Republic of the Congo |     2015    |                45.33                |           2            |
|           South Sudan            |     2015    |                46.33                |           3            |
|              Angola              |     2015    |                50.33                |           4            |
|             Somalia              |     2015    |                50.67                |           5            |
|               Chad               |     2015    |                51.67                |           6            |
|             Ethiopia             |     2015    |                52.00                |           7            |
|            Madagascar            |     2015    |                53.33                |           8            |
|         Papua New Guinea         |     2015    |                53.67                |           9            |
|              Uganda              |     2015    |                55.00                |           10           |
+----------------------------------+-------------+-------------------------------------+------------------------+
Truncated to displaylimit of 10.

## Using value-based window functions
In this notebook, we will explore the use of value-based window functions to access values from the previous row and use these values to calculate the rate of change between consecutive row

In [29]:
%%sql

SELECT
    Country_name,
    Time_period,
    Pct_managed_drinking_water_services
FROM
    united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1048 rows affected.

+--------------+-------------+-------------------------------------+
| Country_name | Time_period | Pct_managed_drinking_water_services |
+--------------+-------------+-------------------------------------+
|  Kazakhstan  |     2015    |                94.67                |
|  Kazakhstan  |     2016    |                94.67                |
|  Kazakhstan  |     2017    |                95.00                |
|  Kazakhstan  |     2018    |                95.00                |
|  Kazakhstan  |     2019    |                95.00                |
|  Kazakhstan  |     2020    |                95.00                |
|  Kyrgyzstan  |     2015    |                89.67                |
|  Kyrgyzstan  |     2016    |                90.33                |
|  Kyrgyzstan  |     2017    |                91.00                |
|  Kyrgyzstan  |     2018    |                91.33                |
+--------------+-------------+-------------------------------------+
Truncated to displaylimit of 10.

### 1. Add a new column with the previous year's percentage of managed drinking water.
Add the line with the LAG() function to the base query above to extract the previous year's percentage of managed drinking water within each country. Store the results in a new column.

In [35]:
%%sql

SELECT
    Country_name,
    Time_period,
    Pct_managed_drinking_water_services,
    LAG(Pct_managed_drinking_water_services) OVER (
        PARTITION BY Country_name  ORDER BY Time_period ASC) AS prev_year_pct_mamaged_water_services
FROM
    united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1048 rows affected.

+--------------+-------------+-------------------------------------+--------------------------------------+
| Country_name | Time_period | Pct_managed_drinking_water_services | prev_year_pct_mamaged_water_services |
+--------------+-------------+-------------------------------------+--------------------------------------+
| Afghanistan  |     2015    |                67.00                |                 None                 |
| Afghanistan  |     2016    |                69.67                |                67.00                 |
| Afghanistan  |     2017    |                72.33                |                69.67                 |
| Afghanistan  |     2018    |                75.33                |                72.33                 |
| Afghanistan  |     2019    |                78.00                |                75.33                 |
| Afghanistan  |     2020    |                80.33                |                78.00                 |
|   Algeria    |     2015    |                92.00                |                 None                 |
|   Algeria    |     2016    |                93.00                |                92.00                 |
|   Algeria    |     2017    |                93.00                |                93.00                 |
|   Algeria    |     2018    |                93.00                |                93.00                 |
+--------------+-------------+-------------------------------------+--------------------------------------+
Truncated to displaylimit of 10.

#### 2. Determine the Annual Rate of Change between consecutive years.
Lets go further and determine the Annual Rate of Change between consecutive years. That is, the difference between Pct_managed_drinking_water_services and Prev_year_pct_managed_drinking_water_services.

Therefore, we subtract the previous percentage of managed drinking water from the current percentage of managed drinking water.

The query will work similarly to the previous one, except that we reuse the LAG() function to calculate the Annual Rate of Change.

NOTE: SQL does not allow us to use the alias we had created within the same SELECT statement directly. Hence, we have to explicitly write the lag function again.

The results will then be returned as a new column named ARC_pct_managed_drinking_water_service

In [39]:
%%sql

SELECT
    Country_name,
    Time_period,
    Pct_managed_drinking_water_services,
    LAG(Pct_managed_drinking_water_services) OVER (
        PARTITION BY Country_name  ORDER BY Time_period ASC) AS prev_year_pct_mamaged_water_services,
    Pct_managed_drinking_water_services - LAG(Pct_managed_drinking_water_services) OVER (
        PARTITION BY Country_name  ORDER BY Time_period ASC) AS ARC_pct_mamaged_water_services
FROM
    united_nations.Access_to_Basic_Services;

Running query in 'mysql+pymysql://root:***@localhost:3306/united_nations'

1048 rows affected.

+--------------+-------------+-------------------------------------+--------------------------------------+--------------------------------+
| Country_name | Time_period | Pct_managed_drinking_water_services | prev_year_pct_mamaged_water_services | ARC_pct_mamaged_water_services |
+--------------+-------------+-------------------------------------+--------------------------------------+--------------------------------+
| Afghanistan  |     2015    |                67.00                |                 None                 |              None              |
| Afghanistan  |     2016    |                69.67                |                67.00                 |              2.67              |
| Afghanistan  |     2017    |                72.33                |                69.67                 |              2.66              |
| Afghanistan  |     2018    |                75.33                |                72.33                 |              3.00              |
| Afghanistan  |     2019    |                78.00                |                75.33                 |              2.67              |
| Afghanistan  |     2020    |                80.33                |                78.00                 |              2.33              |
|   Algeria    |     2015    |                92.00                |                 None                 |              None              |
|   Algeria    |     2016    |                93.00                |                92.00                 |              1.00              |
|   Algeria    |     2017    |                93.00                |                93.00                 |              0.00              |
|   Algeria    |     2018    |                93.00                |                93.00                 |              0.00              |
+--------------+-------------+-------------------------------------+--------------------------------------+--------------------------------+
Truncated to displaylimit of 10.